# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'node'
brew 'redis'
brew 'python'

# Apps
cask 'adobe-creative-cloud'
cask 'iterm2'
cask 'java'
cask 'phpstorm'
cask 'postman'
cask 'tower'
cask 'ray'
cask 'tableplus'
cask 'cleanshot'
cask 'slack'
cask 'discord'
cask '1password'
cask 'synology-drive'
cask 'hey'
cask 'raycast'
cask 'stremio'
cask 'spotify'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Tallieu & Tallieu
cask 'docker'
