# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash'
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'node'
brew 'redis'
brew 'python'
brew 'yarn'

# Apps
cask '1password'
brew '1password-cli'
cask 'adobe-creative-cloud'
cask 'brave-browser'
cask 'cleanshot'
cask 'discord'
cask 'figma'
cask 'hey-desktop'
cask 'iterm2'
cask 'obsidian'
cask 'opencode'
cask 'phpstorm'
cask 'slack'
cask 'synology-drive'
cask 'ray'
cask 'raycast'
cask 'stremio'
cask 'spotify'
cask 'tableplus'
cask 'tower'

# Docker
cask 'docker-desktop'
cask 'karabiner-elements'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-cascadia-code'
cask 'font-cascadia-mono'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-anonymous-pro'
cask 'font-dejavu'
cask 'font-inter'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'font-ubuntu'
cask 'font-ubuntu-mono'

# Mac App Store
mas 'Numbers', id: 409203825
mas 'Pages', id: 361309726