# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
# brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
# brew 'gnupg2'
brew 'grep'
brew 'mackup'
# brew 'mas'
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'trash'
# brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'node'
brew 'redis'
brew 'python'

# Apps
cask 'adobe-creative-cloud'
cask 'discord'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'microsoft-office'
cask 'phpstorm'
cask 'postman'
cask 'pycharm'
cask 'sequel-pro'
cask 'slack'
cask 'stremio'
cask 'spotify'
cask 'tower2'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Sip', id: 507257563
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'WhatsApp', id: 1147396723 